positive_filter = ["[лЛ]амп.*", '[Сc]ветил.*', '[Сc]четч.*', '[эЭ]лектрот.*', '[тТ]рансформат.*',
                   '[пП]итан.*', "[Вв]ыключа.*", "[рР]озетк.*", "[кК]абел.*", "[уУ]длинител.*",
                   "[кК]орпус", "[эЭ]лектричес.*", "[кК]онтроллер.*", "[зЗ]акупк.*", "[мМ]уфт.*",
                   "[фФ]онар.*", "[фФ]ар[аы]"]

negative_filter = ["[уУ]слуг.*", "[оО]бслуживан.*", "[оО]борудован.*", "ТЭН", "Ремонт",
                   "[зЗ]амен.*", "[вВ]ыбор", "[тТ]ермостат.*", "[дД]иагностирован.*",
                   "[шШ]иномонтаж", "[аА]удиоанализатор.*", "[иИ]змерени.*", "[пП]ечатн.*",
                   "[сС]ушилк.*", "[mM]aster", "[пП]ечног.*"]
pattern_positive = '|'.join(positive_filter)
pattern_negative = '|'.join(negative_filter)
